{
  "task_id": "2025-12-03-1",
  "owner_role": "planner_spec",
  "status": "ok",
  "decision": "approve",
  "spec_md": "# 2025-12-03-1 — Skill Tree Viewport & Student Flow Alignment\n\n## 1. Background & Goals\n- The current Skill Tree view clamps width to a narrow panel, so large DAGs require heavy horizontal scrolling and miss the Diablo-style overview goal.\n- Hover tooltips overlap neighboring nodes due to tight spacing, hurting readability and accessibility.\n- Connector arrows terminate mid-air because edges are drawn center-to-center without respecting node boundaries.\n- StudentDashboard still shows legacy S1/S2/S3 content and launches a generic “수학 게임” instead of tying back to the Skill Tree path.\n\n**Objectives**\n1. Deliver a responsive Skill Tree viewport that auto-fits the entire graph on first load across desktop/tablet/mobile.\n2. Ensure hover/focus interactions never hide other nodes; tooltips must be collision-safe and keyboard friendly.\n3. Render connector edges so arrowheads touch node bodies, including bundled edges in dense tiers.\n4. Merge the student dashboard and Skill Tree flows so learners choose a skill path before launching practice, and dashboard visuals use the same tiers/groups.\n5. Instrument the new flow (viewport fit, hover events, practice launch) to monitor UX health.\n\n## 2. Scope\n**In scope**\n- Frontend layout/interaction updates in SkillTreePage, SkillTreeGraph, StudentDashboard, HomePathMap, related CSS, and analytics.\n- Passing selected skill metadata into existing practice session flows (UI plumbing only).\n- Copy/UX adjustments needed for the merged experience.\n\n**Out of scope**\n- Changing backend skill schemas or problem generation logic.\n- Authentication, progress storage, or new content authoring experiences.\n\n## 3. Functional Requirements\n### 3.1 Responsive Viewport & Auto-Fit\n- Replace fixed constants with viewport-derived sizes; minimum horizontal padding 24px (desktop) / 12px (mobile).\n- On initial render (unless user stored zoom), auto-fit the entire graph with ≥40px padding.\n- Provide “전체 보기” control + `Shift+F` shortcut to re-center.\n- On <768px width, collapse the detail panel below the graph and allow the canvas to occupy full width.\n\n### 3.2 Node Spacing & Hover Behavior\n- Compute row spacing as `max(textHeight + 32px, 140px)`; min column spacing 220px.\n- Add hover hitboxes (8px padding) and render tooltips via portal with `z-index: 1000`; re-position when hitting viewport edges.\n- Dim unrelated nodes/edges during hover and announce summary via `aria-live`.\n\n### 3.3 Edge Rendering\n- Use node boundary ports for start/end points; stop arrows 4px before the node border and add arrowheads that align with direction.\n- Bundled edges: show a vertical “bus” with horizontal branches and arrowheads at child nodes.\n- Highlight edges connected to the focused node with thicker strokes.\n\n### 3.4 Unified Student Flow\n- Embed the Skill Tree (or compact overview) inside StudentDashboard above stats.\n- Replace “수학 게임 시작하기” with “이 스킬로 연습 시작” CTA bound to the selected node; disable when nothing is selected.\n- On launch, either navigate to `/skills/{skillId}/problems` or call the practice API with `{course_step_id, skill_id}`.\n- Remove legacy S1/S2/S3 copy from HomePathMap; pull tier labels/groups from the same DAG used by the Skill Tree.\n\n### 3.5 Session Confirmation\n- Before launching practice, show a modal summarizing skill name, tier, prerequisites (met/unmet), and expected XP; actions: “연습 시작” / “취소”.\n- Persist last-selected skill in localStorage for resume.\n\n### 3.6 Telemetry\n- Emit events: `skill_tree_viewport_fitted`, `skill_hover`, `practice_launch_from_tree` with payloads covering node counts, zoom scale, skill IDs, etc.\n- Log auto-seed fallback activation with device info.\n\n## 4. Non-Functional Requirements\n- **Performance**: Auto-fit + layout recompute <120 ms desktop, <200 ms tablet (120 nodes). Graph interactions stay within 16 ms frame budget.\n- **Accessibility**: Keyboard focusable nodes, tooltips announced via screen readers, contrast ≥4.5:1.\n- **Responsive**: Validate layouts at 1280/1024/768/480px.\n- **Localization**: All copy uses i18n utilities.\n\n## 5. Acceptance Criteria\n1. Loading `/skills` or the embedded dashboard tree shows the entire graph within viewport padding; clicking “전체 보기” re-centers after manual zoom/pan.\n2. Hovering/focusing a node displays a tooltip that never overlaps neighbors or bleeds off-screen; unrelated nodes dim until hover ends.\n3. Edge arrowheads terminate on node boundaries, including bundled edges; no arrows end mid-air.\n4. From `/student`, selecting a node and choosing “연습 시작” launches practice for that skill, preceded by the confirmation modal.\n5. Dashboard copy and HomePath visuals reference current tiers/groups (no S1/S2/S3 remnants).\n6. Instrumentation logs the specified analytics events with correct payloads.\n7. On mobile (≤375px width), the graph remains usable and detail panel collapses beneath it.\n\n## 6. Test Plan\n- Component/unit tests for layout math, edge path generation, tooltip positioning, and modal logic (Vitest/Jest).\n- Storybook/visual regression snapshots for breakpoints and hover states.\n- E2E (Playwright): login → dashboard → select skill → confirm modal → launch practice; verify API call includes skill ID.\n- Accessibility QA: keyboard navigation, screen reader announcements.\n\n## 7. Open Questions\n- Should `/skills` redirect into `/student`, or do we maintain both routes with shared layout components?\n- Does the practice session API already accept `skill_id` / `course_step_id` to scope problems? Do we need backend enhancements?\n- Do we keep HomePathMap as a supplemental visualization once the Skill Tree sits on the dashboard?\n\n## 8. Assumptions\n- Skill Tree payload already exposes tier/group metadata required by HomePathMap.\n- Practice session endpoints can ignore extra parameters if not yet consumed (UI can pass for future use).\n- Persisting last-selected skill in localStorage is acceptable for MVP.\n\n## 9. Risks\n- ELK/layout tuning may impact performance on low-end devices.\n- Merging dashboard + Skill Tree can increase bundle size/TTI; code-splitting may be needed.\n- Users may be confused by the new modal flow if guidance is insufficient.\n\n## 10. Chain & Ownership\n1. **Planner** — Finalize scope, deliver schedule, publish UX/metrics brief.\n2. **UX** — Produce responsive mockups, tooltip/modal specs, copy updates.\n3. **Frontend** — Implement auto-fit layout, tooltip/edge rendering, merged student flow, modal, localStorage resume.\n4. **Backend** — Confirm or expose practice parameters needed (if any) and provide metadata for DASH/UI.\n5. **QA Release** — Validate desktop/mobile behavior, hover clarity, practice launch flow; attach evidence/logs.\n6. **Senior Engineer** — Integration review and sign-off.\n\n## 11. Artifacts\n- `tasks/2025-12-03-1.md` — working spec document.\n",
  "acceptance_criteria": [
    "Skill Tree (standalone and embedded) auto-fits the entire DAG on load, with manual \"전체 보기\" restoring view.",
    "Hover/focus tooltips never overlap other nodes or bleed off-screen; unrelated nodes dim and ARIA announcements occur.",
    "Connector arrows terminate on node boundaries (including bundled edges) without mid-air endpoints.",
    "Student dashboard launches skill-scoped practice via confirmation modal, retiring the generic \"수학 게임\" CTA.",
    "Legacy S1/S2/S3 copy is removed; dashboard visuals use current tier/group metadata.",
    "Telemetry events (`skill_tree_viewport_fitted`, `skill_hover`, `practice_launch_from_tree`) fire with expected payloads."
  ],
  "open_questions": [
    "Should `/skills` route redirect to `/student`, or do we maintain both routes with shared components?",
    "Does the practice API already support skill-scoped sessions, or do we need backend updates?",
    "Is HomePathMap retained as a supplemental overview once the Skill Tree is embedded?"
  ],
  "assumptions": [
    "Skill Tree payload already exposes tier/group metadata suitable for HomePathMap.",
    "Practice session endpoints can accept (or ignore) skill identifiers without schema changes.",
    "Persisting last-selected skill locally is acceptable for MVP."
  ],
  "risks": [
    "Viewport/layout recalculations might regress performance on low-end devices.",
    "Merging dashboard + Skill Tree could inflate bundle size and TTI.",
    "New modal flow may confuse users without adequate guidance."
  ],
  "artifacts_out": [
    {
      "type": "spec",
      "uri": "tasks/2025-12-03-1.md"
    }
  ],
  "notes": [
    "Reviewers: focus on feasibility of auto-fit + tooltip requirements and confirm whether backend support is needed for skill-scoped sessions."
  ]
}
