{"task_id":"2025-12-04-1","owner_role":"ux","status":"ok","summary":"Responsive Skill Tree + dashboard flow redesign to fix viewport issues and align practice launch UX.","ux_plan":{"user_flow":["Student opens dashboard landing → sees integrated Skill Tree summary card and CTA.","Selecting \"View Skill Tree\" opens full responsive tree with auto-fit and contextual details panel.","Hover/tap on a node to preview prerequisites, XP, and practice CTA; tooltip repositions to avoid collisions.","Choosing \"Start Practice\" triggers confirmation modal showing selected skill/course step and metadata, then launches session.","Post-launch, return surface updates progress state and telemetry logs practice start."],"screens":[{"name":"Student Dashboard","description":"Merged dashboard featuring Skill Tree summary widget, recent progress, and CTA into full tree.","states":["default","empty","loading","error"]},{"name":"Skill Tree Full View","description":"Diablo-style panoramic tree with auto-fit viewport, responsive spacing, and detail drawer for selected skill.","states":["default","hover","selected","mobile"]},{"name":"Practice Confirmation Modal","description":"Modal confirming skill selection, showing prereqs, XP, and course-step mapping with action buttons.","states":["default","busy","error"]}],"copy_guidelines":["Drop S1/S2/S3 naming; use skill titles and tier labels (e.g., \"Tier 2: Arcane Focus\").","CTA verbs: \"Start Practice\" for primary, \"Preview Skill\" for hover/tooltips.","Modal copy: concise summary sentence + bullet metadata (Prereqs, XP Reward, Recommended Level).","Empty-state message: \"No skills unlocked yet. Complete your current objectives to reveal this tree.\""],"responsive_notes":["Auto-fit tree width up to 1240px, switch to vertical stack below 768px.","Tooltips reposition based on available space; on mobile use bottom sheet detail panel.","Arrows anchor to node perimeter; shrink arrowheads on small screens for clarity."],"accessibility":["Ensure tooltip and modal content reachable via keyboard (focus trap).","Provide aria-live updates when auto-fit completes and when practice launches.","Color choices need 4.5:1 contrast; include icon + text for tier status.","Localize copy strings; avoid embedded metaphors that resist translation."],"data_hooks":["Telemetry events: `skill_tree_viewport_fit`, `skill_node_hover`, `practice_launch_confirmed` with node_id, tier, viewport_size.","API dependencies: `/api/v1/skills/tree`, `/api/v1/skills/nodes/{node_id}/practice-plan`, practice session POST endpoint.","Dashboard fetch for progress summary and XP totals."],"assets_needed":["wireframe-dashboard.png","wireframe-skill-tree.png","modal-copy-spec.md"]},"open_questions":["Is the practice session launch endpoint staying at `/skills/nodes/{node_id}/practice-plan` or being replaced?","Do we need to embed mini tree inside dashboard or link out only?","Should confirmation modal expose estimated time per session?"],"risks":["Backend router currently broken; UX depends on restored endpoints.","Potential performance hit from auto-fit calculations on large trees.","Tooltip collision logic must stay performant on mobile browsers."],"artifacts_out":[{"type":"wireframe","uri":"design/sketches/2025-12-04-1/dashboard.png","status":"planned"}],"notes":["Need coordination with backend to confirm data payloads for prerequisites and XP metadata before final microcopy."]}